#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.dev.data.archive_file.pubsub_function_source["exp"]: Reading...
module.dev.data.archive_file.pubsub_function_source["cloudErrorLog"]: Reading...
module.dev.data.archive_file.pubsub_function_source["frogeOfTheDay"]: Reading...
module.dev.data.archive_file.pubsub_function_source["generateWelcomeImage"]: Reading...
module.dev.data.archive_file.pubsub_function_source["cloudDeploymentLog"]: Reading...
module.dev.data.archive_file.pubsub_function_source["stm"]: Reading...
module.dev.data.archive_file.pubsub_function_source["exp"]: Read complete after 0s [id=3b63dbff8ec0fde6c28727f84ce814edcab313f9]
module.dev.data.archive_file.pubsub_function_source["cloudErrorLog"]: Read complete after 0s [id=c97bdc87edf3230c7f079530555818a0473cc8a2]
module.dev.data.archive_file.pubsub_function_source["privateMessage"]: Reading...
module.dev.data.archive_file.http_function_source["ban"]: Reading...
module.dev.data.archive_file.pubsub_function_source["channelMessage"]: Reading...
module.dev.data.archive_file.pubsub_function_source["stm"]: Read complete after 0s [id=6f8f8e750874119871bbdd1b5ac1d2ee206cc003]
module.dev.data.archive_file.http_function_source["level"]: Reading...
module.dev.data.archive_file.pubsub_function_source["privateMessage"]: Read complete after 0s [id=fea4d40761f0c4d7e4ade9234aff3c676d56b179]
module.dev.data.archive_file.http_function_source["ban"]: Read complete after 0s [id=87b0639e469a259184e4476cecc809db187ff634]
module.dev.data.archive_file.http_function_source["flag"]: Reading...
module.dev.data.archive_file.pubsub_function_source["generateWelcomeImage"]: Read complete after 0s [id=0670e2955e9f86836446bb766bcd64a84f94db45]
module.dev.data.archive_file.pubsub_function_source["cloudDeploymentLog"]: Read complete after 0s [id=ba45a2283b0dfbb4403df49a975ffab286eb54ed]
module.dev.data.archive_file.http_function_source["help"]: Reading...
module.dev.data.archive_file.pubsub_function_source["channelMessage"]: Read complete after 0s [id=b9c78aa296e3992a534329ee12e9400c1db846c2]
module.dev.data.archive_file.http_function_source["answer"]: Reading...
module.dev.data.archive_file.http_function_source["flag"]: Read complete after 0s [id=3c324e538a1c52e11b42bf3fdd2e95c1c00a5783]
module.dev.data.archive_file.http_function_source["http"]: Reading...
module.dev.data.archive_file.http_function_source["froge"]: Reading...
module.dev.data.archive_file.http_function_source["answer"]: Read complete after 0s [id=7e22dcbeb314c119af927f2a07d84c91bc783619]
module.dev.data.archive_file.http_function_source["go"]: Reading...
module.dev.data.archive_file.http_function_source["describe"]: Reading...
module.dev.data.archive_file.http_function_source["level"]: Read complete after 0s [id=86266b212ea30aedbd643f308be80bb12d0a5fd6]
module.dev.data.archive_file.http_function_source["http"]: Read complete after 0s [id=c221dc2f104f758030579ea39e14ee1746c73f73]
module.dev.data.archive_file.http_function_source["video"]: Reading...
module.dev.data.archive_file.http_function_source["froge"]: Read complete after 0s [id=3cc29d594cea4df8c8f6af667a222fd97647a685]
module.dev.data.archive_file.http_function_source["help"]: Read complete after 0s [id=e4f9818109e6d3c6fb840ab00b90c99a6637c51a]
module.dev.data.archive_file.http_function_source["warn"]: Reading...
module.dev.data.archive_file.http_function_source["go"]: Read complete after 0s [id=ca54a48bb5d689229b9e2ee441ea2611944ae713]
module.dev.data.archive_file.http_function_source["describe"]: Read complete after 0s [id=8149d3888af4d77844b83253c94a05cff143ff3f]
module.dev.data.archive_file.http_function_source["exam"]: Reading...
module.dev.data.archive_file.http_function_source["listwarn"]: Reading...
module.dev.data.archive_file.http_function_source["video"]: Read complete after 0s [id=428553a64384a42bd7c9e918bd72bb240172e07d]
module.dev.data.archive_file.http_function_source["leaderboard"]: Reading...
module.dev.data.archive_file.http_function_source["exam"]: Read complete after 0s [id=de84a649e65565d61e8a1a7a1a7d53dff2f906e0]
module.dev.data.archive_file.http_function_source["hello"]: Reading...
module.dev.data.archive_file.http_function_source["listwarn"]: Read complete after 0s [id=2ac77fd164c9303aa5a90d42c11499d849d35e0c]
module.dev.data.archive_file.http_function_source["java"]: Reading...
module.dev.data.archive_file.http_function_source["leaderboard"]: Read complete after 0s [id=a793316da15897fe031a9c29bc977344a76cf676]
module.dev.data.archive_file.http_function_source["src"]: Reading...
module.dev.data.archive_file.http_function_source["js"]: Reading...
module.dev.data.archive_file.http_function_source["warn"]: Read complete after 0s [id=23711e28cc000cf97afea64131ad0b918084cc7e]
module.dev.data.archive_file.http_function_source["gif"]: Reading...
module.dev.data.archive_file.http_function_source["src"]: Read complete after 0s [id=d283a62085b3665676857075d5397e051990724b]
module.dev.data.archive_file.http_function_source["hello"]: Read complete after 0s [id=d3aff51c68f98c729867e28f35be543c27184d8e]
module.dev.data.archive_file.http_function_source["gif"]: Read complete after 0s [id=ade2bf534a1bf94beac9b4924ebb04d92f75a7a3]
module.dev.data.archive_file.http_function_source["java"]: Read complete after 0s [id=5c394ffff4f20dea8bc47029905259fa732a6a85]
module.dev.data.archive_file.http_function_source["js"]: Read complete after 0s [id=358d1a99ccf5ba2b4581cb504eb5c5b38aadc2e7]
module.dev.data.archive_file.pubsub_function_source["updateUserRole"]: Reading...
module.dev.data.archive_file.pubsub_function_source["updateUserRole"]: Read complete after 0s [id=70bbdeada9ccdbd989dadcb475dd9947b0cc95c6]
module.dev.data.archive_file.pubsub_function_source["frogeOfTheDay"]: Read complete after 1s [id=f9f02508910a5e23f3b8de2947ed1f573d4ed654]
module.dev.google_logging_project_sink.cloud_function_crud_sing: Refreshing state... [id=projects/archy-f06ed/sinks/archy-cloud-function-crud-dev]
module.dev.google_logging_project_sink.cloud_function_error_sink: Refreshing state... [id=projects/archy-f06ed/sinks/archy-cloud-function-error-dev]
module.dev.google_pubsub_topic.pubsub_topic["private_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_private_message_discord]
module.dev.google_pubsub_topic.pubsub_topic["cloud_function_crud_log"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_cloud_function_crud_log]
module.dev.google_pubsub_topic.pubsub_topic["exp_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_exp_discord]
module.dev.google_pubsub_topic.pubsub_topic["generate_welcome_image"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_generate_welcome_image]
module.dev.google_pubsub_topic.pubsub_topic["stm_status"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_stm_status]
module.dev.google_pubsub_topic.pubsub_topic["channel_message_discord"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_channel_message_discord]
module.dev.google_pubsub_topic.pubsub_topic["update_user_role"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_update_user_role]
module.dev.google_pubsub_topic.pubsub_topic["cloud_function_error_log"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_cloud_function_error_log]
module.dev.google_pubsub_topic.pubsub_topic["froge_of_the_day"]: Refreshing state... [id=projects/archy-f06ed/topics/dev_froge_of_the_day]
module.dev.google_storage_bucket.function_bucket: Refreshing state... [id=archy-f06ed-function-dev]
module.dev.google_storage_bucket.froge: Refreshing state... [id=froge-public-bucket-dev]
module.dev.google_secret_manager_secret.secret["YOUTUBE_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/YOUTUBE_API_TOKEN]
module.dev.google_secret_manager_secret.secret["DISCORD_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/DISCORD_TOKEN]
module.dev.google_secret_manager_secret.secret["TENOR_API_TOKEN"]: Refreshing state... [id=projects/archy-f06ed/secrets/TENOR_API_TOKEN]
module.dev.google_secret_manager_secret.secret["STM_API_KEY"]: Refreshing state... [id=projects/archy-f06ed/secrets/STM_API_KEY]
module.dev.google_compute_instance.default: Refreshing state... [id=projects/archy-f06ed/zones/us-central1-a/instances/e2-micro-archy]
module.dev.google_storage_bucket_object.pubsub_function_zip["privateMessage"]: Refreshing state... [id=archy-f06ed-function-dev-src-fea4d40761f0c4d7e4ade9234aff3c676d56b179.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["channelMessage"]: Refreshing state... [id=archy-f06ed-function-dev-src-b9c78aa296e3992a534329ee12e9400c1db846c2.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["updateUserRole"]: Refreshing state... [id=archy-f06ed-function-dev-src-70bbdeada9ccdbd989dadcb475dd9947b0cc95c6.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["exp"]: Refreshing state... [id=archy-f06ed-function-dev-src-3b63dbff8ec0fde6c28727f84ce814edcab313f9.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["cloudDeploymentLog"]: Refreshing state... [id=archy-f06ed-function-dev-src-ba45a2283b0dfbb4403df49a975ffab286eb54ed.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["generateWelcomeImage"]: Refreshing state... [id=archy-f06ed-function-dev-src-0670e2955e9f86836446bb766bcd64a84f94db45.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["stm"]: Refreshing state... [id=archy-f06ed-function-dev-src-588825a226b222d0f973e60ed5afbcd00abf6af4.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["frogeOfTheDay"]: Refreshing state... [id=archy-f06ed-function-dev-src-f9f02508910a5e23f3b8de2947ed1f573d4ed654.zip]
module.dev.google_storage_bucket_object.pubsub_function_zip["cloudErrorLog"]: Refreshing state... [id=archy-f06ed-function-dev-src-c97bdc87edf3230c7f079530555818a0473cc8a2.zip]
module.dev.google_storage_bucket_object.http_function_zip["java"]: Refreshing state... [id=archy-f06ed-function-dev-src-5c394ffff4f20dea8bc47029905259fa732a6a85.zip]
module.dev.google_storage_bucket_object.http_function_zip["hello"]: Refreshing state... [id=archy-f06ed-function-dev-src-d3aff51c68f98c729867e28f35be543c27184d8e.zip]
module.dev.google_storage_bucket_object.http_function_zip["exam"]: Refreshing state... [id=archy-f06ed-function-dev-src-de84a649e65565d61e8a1a7a1a7d53dff2f906e0.zip]
module.dev.google_storage_bucket_object.http_function_zip["go"]: Refreshing state... [id=archy-f06ed-function-dev-src-ca54a48bb5d689229b9e2ee441ea2611944ae713.zip]
module.dev.google_storage_bucket_object.http_function_zip["http"]: Refreshing state... [id=archy-f06ed-function-dev-src-c221dc2f104f758030579ea39e14ee1746c73f73.zip]
module.dev.google_storage_bucket_object.http_function_zip["src"]: Refreshing state... [id=archy-f06ed-function-dev-src-d283a62085b3665676857075d5397e051990724b.zip]
module.dev.google_storage_bucket_object.http_function_zip["froge"]: Refreshing state... [id=archy-f06ed-function-dev-src-3cc29d594cea4df8c8f6af667a222fd97647a685.zip]
module.dev.google_storage_bucket_object.http_function_zip["leaderboard"]: Refreshing state... [id=archy-f06ed-function-dev-src-a793316da15897fe031a9c29bc977344a76cf676.zip]
module.dev.google_storage_bucket_object.http_function_zip["gif"]: Refreshing state... [id=archy-f06ed-function-dev-src-ade2bf534a1bf94beac9b4924ebb04d92f75a7a3.zip]
module.dev.google_storage_bucket_object.http_function_zip["warn"]: Refreshing state... [id=archy-f06ed-function-dev-src-23711e28cc000cf97afea64131ad0b918084cc7e.zip]
module.dev.google_storage_bucket_object.http_function_zip["flag"]: Refreshing state... [id=archy-f06ed-function-dev-src-3c324e538a1c52e11b42bf3fdd2e95c1c00a5783.zip]
module.dev.google_storage_bucket_object.http_function_zip["answer"]: Refreshing state... [id=archy-f06ed-function-dev-src-7e22dcbeb314c119af927f2a07d84c91bc783619.zip]
module.dev.google_storage_bucket_object.http_function_zip["listwarn"]: Refreshing state... [id=archy-f06ed-function-dev-src-2ac77fd164c9303aa5a90d42c11499d849d35e0c.zip]
module.dev.google_storage_bucket_object.http_function_zip["level"]: Refreshing state... [id=archy-f06ed-function-dev-src-86266b212ea30aedbd643f308be80bb12d0a5fd6.zip]
module.dev.google_storage_bucket_object.http_function_zip["help"]: Refreshing state... [id=archy-f06ed-function-dev-src-e4f9818109e6d3c6fb840ab00b90c99a6637c51a.zip]
module.dev.google_storage_bucket_object.http_function_zip["ban"]: Refreshing state... [id=archy-f06ed-function-dev-src-87b0639e469a259184e4476cecc809db187ff634.zip]
module.dev.google_storage_bucket_object.http_function_zip["js"]: Refreshing state... [id=archy-f06ed-function-dev-src-358d1a99ccf5ba2b4581cb504eb5c5b38aadc2e7.zip]
module.dev.google_storage_bucket_object.http_function_zip["describe"]: Refreshing state... [id=archy-f06ed-function-dev-src-8149d3888af4d77844b83253c94a05cff143ff3f.zip]
module.dev.google_storage_bucket_object.http_function_zip["video"]: Refreshing state... [id=archy-f06ed-function-dev-src-428553a64384a42bd7c9e918bd72bb240172e07d.zip]
module.dev.google_storage_bucket_access_control.public_rule: Refreshing state... [id=froge-public-bucket-dev/allUsers]
module.dev.google_cloudfunctions_function.pubsub_function["channelMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_channelMessage]
module.dev.google_cloudfunctions_function.pubsub_function["exp"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_exp]
module.dev.google_cloudfunctions_function.pubsub_function["generateWelcomeImage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_generateWelcomeImage]
module.dev.google_cloudfunctions_function.pubsub_function["updateUserRole"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_updateUserRole]
module.dev.google_cloudfunctions_function.pubsub_function["cloudErrorLog"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_cloudErrorLog]
module.dev.google_cloudfunctions_function.pubsub_function["cloudDeploymentLog"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_cloudDeploymentLog]
module.dev.google_cloudfunctions_function.pubsub_function["stm"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_stm]
module.dev.google_cloudfunctions_function.pubsub_function["frogeOfTheDay"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_frogeOfTheDay]
module.dev.google_cloudfunctions_function.pubsub_function["privateMessage"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_privateMessage]
module.dev.google_cloudfunctions_function.http_function["level"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_level]
module.dev.google_cloudfunctions_function.http_function["ban"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_ban]
module.dev.google_cloudfunctions_function.http_function["warn"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_warn]
module.dev.google_cloudfunctions_function.http_function["help"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_help]
module.dev.google_cloudfunctions_function.http_function["src"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_src]
module.dev.google_cloudfunctions_function.http_function["go"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_go]
module.dev.google_cloudfunctions_function.http_function["describe"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_describe]
module.dev.google_cloudfunctions_function.http_function["gif"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_gif]
module.dev.google_cloudfunctions_function.http_function["listwarn"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_listwarn]
module.dev.google_cloudfunctions_function.http_function["hello"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_hello]
module.dev.google_cloudfunctions_function.http_function["exam"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_exam]
module.dev.google_cloudfunctions_function.http_function["video"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_video]
module.dev.google_cloudfunctions_function.http_function["http"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_http]
module.dev.google_cloudfunctions_function.http_function["java"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_java]
module.dev.google_cloudfunctions_function.http_function["js"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_js]
module.dev.google_cloudfunctions_function.http_function["flag"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_flag]
module.dev.google_cloudfunctions_function.http_function["answer"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_answer]
module.dev.google_cloudfunctions_function.http_function["froge"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_froge]
module.dev.google_cloudfunctions_function.http_function["leaderboard"]: Refreshing state... [id=projects/archy-f06ed/locations/us-central1/functions/dev_leaderboard]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.google_cloudfunctions_function.pubsub_function["stm"] will be updated in-place
  ~ resource "google_cloudfunctions_function" "pubsub_function" {
        id                    = "projects/archy-f06ed/locations/us-central1/functions/dev_stm"
        name                  = "dev_stm"
      ~ source_archive_object = "src-588825a226b222d0f973e60ed5afbcd00abf6af4.zip" -> "src-6f8f8e750874119871bbdd1b5ac1d2ee206cc003.zip"
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.dev.google_storage_bucket_object.pubsub_function_zip["stm"] must be replaced
-/+ resource "google_storage_bucket_object" "pubsub_function_zip" {
      + content          = (sensitive value)
      ~ crc32c           = "p5xDfQ==" -> (known after apply)
      ~ detect_md5hash   = "KBguD2czIwL7x3Aiu7T1YA==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "archy-f06ed-function-dev-src-588825a226b222d0f973e60ed5afbcd00abf6af4.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "KBguD2czIwL7x3Aiu7T1YA==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/archy-f06ed-function-dev/o/src-588825a226b222d0f973e60ed5afbcd00abf6af4.zip?generation=1704770142042469&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "src-588825a226b222d0f973e60ed5afbcd00abf6af4.zip" -> "src-6f8f8e750874119871bbdd1b5ac1d2ee206cc003.zip" # forces replacement
      ~ output_name      = "src-588825a226b222d0f973e60ed5afbcd00abf6af4.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/archy-f06ed-function-dev/o/src-588825a226b222d0f973e60ed5afbcd00abf6af4.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @ArmandBriere, Action: `pull_request`, Workflow: `Terraform plan`*